Configuration/Documents/бит_ум_КвитанцияЗаПатент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_ум_КвитанцияЗаПатент</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_ум_ОплатаПатентов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМесяцев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Configuration/AccumulationRegisters/бит_ум_ОплатаПатентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бит_ум_ОплатаПатентов</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Configuration/Documents/бит_ум_КвитанцияЗаПатент/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий	

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗарплатаКадры.ЗаполнитьЗначениеРеквизитаОрганизацияПриОднофирменномУчете(ЭтотОбъект);
	
	Если НЕ ЗначениеЗаполнено(НачалоПериода) Тогда
		НачалоПериода = НачалоМесяца(ТекущаяДатаСеанса());
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КоличествоМесяцев) Тогда
		КоличествоМесяцев = 1;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("Сотрудник")
		И ЗначениеЗаполнено(ДанныеЗаполнения.Сотрудник) И (НЕ ДанныеЗаполнения.Свойство("Организация")
		ИЛИ НЕ ЗначениеЗаполнено(ДанныеЗаполнения.Организация)) Тогда
		
		ИменаКадровыхДанных = "Организация";
	
		КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудников(Истина, ДанныеЗаполнения.Сотрудник, ИменаКадровыхДанных, Дата);
		Если КадровыеДанные.Количество() > 0 Тогда
			ДанныеЗаполнения.Вставить("Организация", КадровыеДанные[0].Организация);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПараметрыПроведения = ПолучитьДанныеДляПроведения(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияПоРегистрам(ПараметрыПроведения, Отказ);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДвиженияПоРегистрам(ПараметрыПроведения, Отказ)
	
	Движения.бит_ум_ОплатаПатентов.Записывать = Истина;
	
	Для Каждого Строка Из ПараметрыПроведения.ОплатаПатентов Цикл
		СуммаОсталось = Строка.Сумма;
		ТекущийНомерМесяца = 1;
		ТекущийПериод = Строка.ПериодВзаиморасчетов;
		Пока ТекущийНомерМесяца <= Строка.КоличествоМесяцев Цикл
			Движение = Движения.бит_ум_ОплатаПатентов.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, Строка, , "ПериодВзаиморасчетов, Сумма");
			Движение.ПериодВзаиморасчетов = ТекущийПериод;
			Движение.Сумма = Строка.Сумма / Строка.КоличествоМесяцев;
			СуммаОсталось = СуммаОсталось - Движение.Сумма;
			ТекущийПериод = ДобавитьМесяц(Строка.ПериодВзаиморасчетов, ТекущийНомерМесяца);
			ТекущийНомерМесяца = ТекущийНомерМесяца + 1;
		КонецЦикла;
		Движение.Сумма = Движение.Сумма + СуммаОсталось;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДанныеДляПроведения(Отказ)
		
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КвитанцияЗаПатент.Дата КАК Период,
	|	КвитанцияЗаПатент.Организация КАК Организация,
	|	КвитанцияЗаПатент.ФизическоеЛицо КАК ФизическоеЛицо,
	|	КвитанцияЗаПатент.НачалоПериода КАК НачалоПериода,
	|	КвитанцияЗаПатент.КоличествоМесяцев КАК КоличествоМесяцев,
	|	КвитанцияЗаПатент.НачалоПериода КАК ПериодВзаиморасчетов,
	|	КвитанцияЗаПатент.СуммаДокумента КАК Сумма
	|ИЗ
	|	Документ.бит_ум_КвитанцияЗаПатент КАК КвитанцияЗаПатент
	|ГДЕ
	|	КвитанцияЗаПатент.Ссылка = &Регистратор";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеДляПроведения = Новый Структура; 
	
	ДанныеДляПроведения.Вставить("ОплатаПатентов", РезультатыЗапроса[0].Выгрузить());
	
	Возврат ДанныеДляПроведения;

КонецФункции	

#КонецОбласти
	
#КонецЕсли
